package chap02;

public class Chap2_Final {
	public static void main(String[] args) {
		// 1. 변수
		// 정의 : 데이터를 저장하는 공간
		// 기본데이터 타입, 참조데이터 타입
		// 선언, 초기화
		// 변수의 명명규칙 : 카멜 표기법을 따르고, 예약어를 사용할 수 없다.
		// 리터럴 : 언어에서 사용되는 순수한 데이터값(정수, 실수, 문자, 문자열, 논리)
		// 변수의 범위 : 블럭내에서 사용됨
		
		// 2. 데이터 타입
		// 8종류의 기본 데이터타입
		// 정수 4개 문자 1개 실수 2개 논리 1개
		// byte short int long
		// char
		// float double
		// boolean
		
		// 3. 타입 변환
		// 묵시적 형변환, 명시적 형변환
		// 묵시적 : 작은 크기의 데이터를 큰 데이터 타입에 대입할 때 생기는것
		// 명시적 : 큰 크기의 데이터를 작은 데이터 타입에 대입할 때 생기는것
		// >>> 컴파일 에러 >> 캐스트 연산자를 이용해 값에 대한 손해를 보고 입력
		// int이하의 정수 데이터 타입은 연산시 int으로 변환
		// 이항 연산자 간의 연산에서 피연산자 타입이 더 큰쪽으로 자동 형변환 
	}
}
